/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   lem_in.h                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mrolfe <mrolfe@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/06/29 13:25:07 by mrolfe            #+#    #+#             */
/*   Updated: 2019/06/29 15:06:03 by mrolfe           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#define MAXV 7000   /*максимальное количество вершин */

/*структура для создания списка путей*/
typedef struct 
{
    char *y; /* элемент  */
    struct path *next; /* следующий элемент в списке */
} path;

/* структура для графа*/
typedef struct 
{
    path *ways[MAXV + 1]; /* информация о смежности ????? */
    int nvertices;  /* количество вершин в графе */
    int nedges; /* количество ребер в графе */
}   graph;
